tap "homebrew/bundle"
tap "homebrew/services"
tap "pulumi/tap"
brew "bat"
brew "btop"
brew "buf"
brew "chezscheme"
brew "clang-format"
brew "delve"
brew "difftastic"
brew "dive"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "golangci-lint"
brew "htop"
brew "jq"
brew "mcfly"
brew "neovim"
brew "nvm"
brew "postgresql@14"
brew "ripgrep"
brew "sbcl"
brew "starship"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-commit-mono-nerd-font"
cask "font-fira-code"
cask "ghostty"
cask "visual-studio-code"
vscode "angular.ng-template"
vscode "bufbuild.vscode-buf"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google-cloud-spanner-ecosystem.google-cloud-spanner-driver"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"